{"basics":{"name":"Eriko Werbet","email":"werbet@gmail.com","phone":"Contido na versão em PDF","url":"https://www.linkedin.com/in/eriko","summary":"Arquiteto de Soluções e Engenheiro de Software fluente em Inglês com mais de 20 anos de experiência e formação sólida em Computação. Reconhecido por sua liderança técnica na pré-venda e execução de projetos inovadores em IoT, Big Data e Inteligência Artificial. Atualmente cursando MBA em Data Science e Analytics, busca aplicar análise de dados, machine learning e IA generativa para acelerar a transformação digital e apoiar decisões estratégicas.","location":{"city":"Fortaleza","region":"Ceará","countryCode":"BR"}},"work":[{"name":"Instituto Atlântico","position":"Arquiteto de Soluções Consultor","startDate":"2020-01","endDate":"2024-12","summary":"Nesta posição trabalhei como líder de Arquitetura de Soluções da instituição e liderei um grupo com mais 6 arquitetos. Trabalhei apoiando a área Comercial, de Inovação e Operação da instituição.","highlights":["Projetei 96 soluções técnicas para clientes em prospecção e projetos em andamento.","Criei, entreguei e apresentei mais de 100 apresentações técnicas demonstrando o valor agregado dessas soluções para clientes nacionais e internacionais.","Elaborei propostas técnicas para projetos de clientes, editais públicos, programa de aceleração de startups institucional e consultorias externas, contribuindo para a captação de mais de 50 milhões de reais em 4 anos.","Ajudei a estruturar o grupo de arquitetos de soluções institucional (grupo de pré-venda técnica), onde liderei e mentorei uma equipe de 6 arquitetos, focando em habilidades técnicas e desenvolvimento profissional.","Avaliei tecnicamente 192 oportunidades de negócio, incluindo RFPS, leads comerciais e editais públicos.","Levantei requisitos técnicos e de negócios de mais de 20 clientes de portfólio e stakeholders, e mais de 30 clientes em potencial.","Defini planos de implementação para 96 projetos, incluindo seus riscos, premissas e restrições.","Estimei o esforço de execução desses projetos, cronograma macro, composição da equipe e recursos necessários.","Preparei documentação para submissão em 33 editais e licitações públicas.","Apoiei iniciativas da área de Inovação através de prospecção tecnológica, submissão para editais de fomento e participação em Provas de Conceito (PoCs).","Contribuí para o planejamento estratégico institucional, incluindo a estratégia de credenciamento junto à EMBRAPII (Empresa Brasileira de Pesquisa e Inovação Industrial).","Desenvolvi conteúdo técnico para mais de 20 materiais de marketing e defendi 7 projetos junto a instituições nacionais de fomento."]},{"name":"Instituto Atlântico","position":"Analista de Desenvolvimento de Sistemas Sênior","startDate":"2006-01","endDate":"2019-12","summary":"Nesta posição trabalhei durante 13 anos como líder técnico, arquiteto e desenvolvedor de software. Trabalhei na execução de projetos para clientes corporativos dos portfólios institucionais, e projetos de P&D financiados por órgãos nacionais e internacionais de fomento à pesquisa e inovação.","highlights":["Liderei tecnicamente 9 projetos de P&D com times de até 15 desenvolvedores para clientes corporativos como Hewlett-Packard (HP) Brasil e HP Palo Alto dos EUA, Samsung, LG e AOC; e instituições públicas como a RNP (Rede Brasileira para Educação e Pesquisa) e a Comissão da União Europeia.","Ajudei a implementar e entregar 12 soluções de software; de firmware em C/C++ para dispositivos móveis, passando por controlador de redes de comunicação TCP/IP em Java, backends para aplicações Web corporativas em nuvens privadas, até plataformas de IoT (Internet das Coisas) para aplicações na área da saúde.","Substituí gerentes de projeto em várias oportunidades, incluindo férias, licença maternidade e licença médica. Gerenciei backlogs e ofereci suporte às atividades em andamento, mantendo o planejamento do projeto.","Atuei como referência técnica em nível institucional, oferecendo soluções e orientando na resolução de problemas nos projetos que trabalhei e em projetos de outros portfólios institucionais.","Contribuí para o projeto da arquitetura de solução dos projetos, desde a diagramação de funcionalidades em UML até a negociação de propriedades ortogonais com os clientes; incluindo a identificação e mitigação proativa de riscos técnicos associados.","Prospectei e selecionei tecnologias, ferramentas e técnicas para a implementação das arquiteturas de solução projetadas. Desde a linguagem de programação até os frameworks e ferramentas de desenvolvimento.","Implementei Provas de Conceito (PoCs) para validar soluções projetadas e tecnologias prospectadas, como frameworks para API gateways (Express Gateway), middlewares de comunicação interprocesso (RabbitMQ) e plataformas para processamento de streaming em tempo real (Apache Kafka).","Suportei o time Comercial em mais de 100 propostas técnicas e editais públicos nesses 13 anos; do entendimento do problema em reuniões com o cliente até o projeto da solução e estimativa de esforço e time necessário."]},{"name":"Universidade de Fortaleza","position":"Professor Adjunto","startDate":"2011-01","endDate":"2020-12","summary":"Trabalhei como professor e orientador de alunos de graduação dos seguintes cursos: Ciência da Computação, Engenharia de Computação, Engenharias Elétrica, Eletrônica e de Automação, assim como Análise e Desenvolvimento de Sistemas. Nesses cursos ministrei as disciplinas de Bancos de Dados I e II, Sistemas Operacionais, Algoritmos, Estruturas de Dados, Programação Aplicada à Automação e Lógica Matemática."},{"name":"Universidade de Fortaleza","position":"Bolsista DTI nível 1 - Engenheiro de Software","startDate":"2004-01","endDate":"2006-12","summary":"Trabalhei como bolsista DTI-1 (Desenvolvimento Tecnológico e Industrial do CNPq) em projeto de P&D da Siemens do Brasil. Atuei na implementação de um device driver para uma placa de hardware de unidade de resposta audível (URA). Além do device driver, também trabalhei na implementação em C/C++ da ferramenta de debug do firmware da placa, API de comunicação e na aplicação de demonstração."},{"name":"Universidade de Fortaleza","position":"Bolsista CNPq - Desenvolvedor de Software","startDate":"2002-01","endDate":"2003-12","summary":"Trabalhei como bolsista em projeto de P&D na implementação de uma nova arquitetura armazenamento, baseada em um novo paradigma de bancos de dados. Neste projeto trabalhei implementando a plataforma, seus algoritmos e experimentos em C/C++ e Java."},{"name":"Universidade de Fortaleza","position":"Bolsista CNPq - Pesquisador","startDate":"2000-01","endDate":"2002-12","summary":"Trabalhei como bolsista em projeto de P&D em Análise de Risco, Incerteza e Complexidade na Tomada de Decisão em Recursos Hídricos e Meio Ambiente; em parceria com a FUNCEME (Fundação Cearense de Meteorologia). Neste projeto trabalhei com otimização linear, redes neurais e algoritmos genéticos. Implementações em C/C++."},{"name":"Complus Informática Ltda.","position":"Estágio - Desenvolvedor de Software","startDate":"1997-01","endDate":"1999-12","summary":"Estágio em uma software house de sistemas financeiros, onde eu era responsável por desenvolver novas funcionalidades e customizar os sistemas já implantados nos clientes. Programei em Clipper e usei bancos de dados DBASE e FoxPro."}],"education":[{"institution":"Universidade de São Paulo","studyType":"MBA","area":"Data Science e Analytics","startDate":"2025","endDate":"2026","courses":["Monografia em IA Generativa e Machine Learning"]},{"institution":"Universidade de Fortaleza","studyType":"Doutorado","area":"Informática Aplicada","startDate":"2011","endDate":"2015","courses":["Pesquisa em Sistemas Operacionais","Disciplinas Concluídas, Tese Incompleta"]},{"institution":"Universidade de Fortaleza","studyType":"Mestrado","area":"Informática Aplicada","startDate":"2005","endDate":"2008","courses":["Dissertação em Bancos de Dados"]},{"institution":"Universidade de Fortaleza","studyType":"Bacharelado","area":"Informática","startDate":"1999","endDate":"2004","courses":["Monografia em Bancos de Dados"]}],"awards":[{"title":"Bolsa de Doutorado","date":"2011","awarder":"Instituto Atlântico"},{"title":"Bolsa de Mestrado","date":"2005","awarder":"FUNCAP (Fundação Cearense de Amparo à Pesquisa)"},{"title":"Bolsa DTI nível I","date":"2004","awarder":"CNPq (Conselho Nacional de Desenvolvimento Cientifico)"},{"title":"Graduação com Honras","date":"2004","awarder":"Universidade de Fortaleza"},{"title":"Bolsa de Iniciação Científica","date":"2000","awarder":"CNPq (Conselho Nacional de Desenvolvimento Científico)"}],"skills":[{"name":"Arquitetura de Soluções","level":"Experiente","keywords":["Padrões de arquitetura","arquiteturas de referência","padrões de projeto","UML","integração de componentes","Ambientes de nuvem e seus serviços","Modelagem de bancos de dados","SQL","NoSQL","tecnologias de Big Data e análise de dados","Conceitos, frameworks e aplicações práticas de IA e Machine Learning","Elaboração de propostas técnicas corporativas e submissão para editais públicos"]},{"name":"Desenvolvimento de Software","level":"Experiente","keywords":["Estruturas de dados e algoritmos","Python, Ruby, Java, JavaScript, C/C++","Frameworks e tecnologias de backend para APIs e serviços","Integração e entrega contínua (CI/CD)","Git","Docker","automação do ciclo de desenvolvimento","Deployment em nuvem (Amazon AWS)","Sistemas Operacionais POSIX (Linux e Unix)"]},{"name":"Ciência de Dados e IA","level":"Cursando MBA na área","keywords":["Estatística, álgebra linear e cálculo","Python, pandas, numpy, scipy, scikit-learn, matplotlib/seaborn","distribuições de probabilidade","amostragem e redução de dimensionalidade","Modelos de machine learning supervisionados e não supervisionados","Aplicações de IA generativa","LLMs e suas APIs","Agentic Al e prompt engineering"]},{"name":"Liderança","keywords":["Liderei tecnicamente time com 6 arquitetos de soluções, mais de 100 iniciativas técnica-comerciais e 9 projetos de desenvolvimento com até 15 profissionais"]},{"name":"Comunicação","keywords":["Levantei requisitos com mais de 50 clientes","negociei funcionalidades com stakeholders nacionais e internacionais (Inglês)","publiquei artigos","defendi projetos perante instituições de fomento","Fui professor universitário durante 10 anos"]},{"name":"Colaboração e Proatividade","keywords":["Colaborei proativamente com as áreas Comercial, de Inovação, Operação e Marketing","Prestei consultoria técnica para projetos de múltiplos portfólios e startups"]},{"name":"Pensamento Crítico e Resolução de Problemas","keywords":["Avaliei 192 iniciativas comerciais, de RFPs a editais públicos","Implementei ferramentas para aumentar minha eficiência e dos times que trabalhei","Identifiquei e corrigi problemas em projetos, soluções técnicas, propostas comerciais, estimativas de esforço etc."]}],"publications":[{"name":"An agent program in an IoT system to recommend activities to minimize childhood obesity problems.","publisher":"Proceedings of the 35th ACM/SIGAPP Symposium on Applied Computing (SAC 20)","releaseDate":"2020","url":"https://doi.org/10.1145/3341105.3373977","summary":"An agent program in an lol system to recommend activities to minimize childhood obesity problems."},{"name":"An Agent Program in an IoT System to Recommend Plans of Activities to Minimize Childhood Obesity.","publisher":"2020 IEEE 44th Annual Computers, Software, and Applications Conference (COMPSAC)","releaseDate":"2020","url":"https://doi.org/10.1109/COMPSAC48688.2020.0-181","summary":"An Agent Program in an IoT System to Recommend Plans of Activities to Minimize Childhood Obesity."},{"name":"Smart Algorithm for Unhealthy Behavior Detection in Health Parameters.","publisher":"2020 IEEE 44th Annual Computers, Software, and Applications Conference (COMPSAC)","releaseDate":"2020","url":"https://doi.org/10.1109/COMPSAC48688.2020.0-183","summary":"Smart Algorithm for Unhealthy Behavior Detection in Health Parameters."},{"name":"Computerized decision support and machine learning applications for the prevention and treatment of childhood obesity: A systematic review of the literature.","publisher":"Artificial Intelligence in Medicine","releaseDate":"2020","url":"https://doi.org/10.1016/j.artmed.2020.101844","summary":"Computerized decision support and machine learning applications for the prevention and treatment of childhood obesity: A systematic review of the literature."}],"projects":[{"name":"Unidade EMBRAPII do Instituto Atlântico","description":"Fui responsável pela concepção técnica e contribui substancialmente para a estratégia de credenciamento bem-sucedida do Instituto Atlântico como uma unidade EMBRAPII, estabelecendo um novo canal de financiamento.","highlights":["Executei pesquisa abrangente sobre unidades EMBRAPII existentes e concorrentes, fundamentando a proposta de valor única da nova unidade.","Desenvolvi a justificativa técnica para a expertise da unidade, utilizando projetos institucionais, e redigi a maioria dos documentos críticos de submissão.","Participei de todo o processo de submissão e defesa, culminando na criação da unidade EMBRAPII de 'Manufatura Inteligente'.","Desempenhei papel chave na estruturação inicial desta nova unidade de negócios e treinei equipes de diversas áreas da instituição para suas operações."]},{"name":"Design e Arquitetura de Solução de Plataforma de Big Data para uma Empresa de Tecnologia Global","description":"Liderei o design técnico e a pré-venda bem sucedida de uma plataforma de Big Data de R$ 17.000.000,00 para uma inovadora global de tecnologia, especialista em eletrônicos de consumo e software. Esta solução abrangente foi projetada para ingerir, processar e analisar vastos conjuntos de dados de diversas fontes, como maquinário industrial, APIs, bancos de dados, sensores e softwares de chão-de-fábrica, fornecendo insights cruciais para otimizar as operações de manufatura.","highlights":["Arquitetura de Solução End-to-End: Desenhei todos os aspectos técnicos da plataforma de Big Data, incluindo pipelines de ingestão de dados, soluções de armazenamento, frameworks de processamento e recursos de análise.","Estratégia de Implantação em Nuvem: Arquitei toda a solução para ser implantada na infraestrutura de nuvem AWS, aproveitando serviços escaláveis e econômicos.","Planejamento e Estimativa de Recursos: Estimei o tamanho da equipe e identifiquei todos os recursos técnicos necessários para a execução do projeto, incluindo hardware especializado, software e pessoal.","Engajamento com Stakeholders: Apresentei com sucesso a complexa solução técnica para equipes de gerência senior e engenharia na Alemanha e nos Estados Unidos, garantindo a adesão e a aprovação do projeto."]},{"name":"Primeiro Projeto PPI SOFTEX do Instituto Atlântico","description":"A SOFTEX e os PPIs (Programas e Projetos Prioritários de Interesse Nacional) são pilares para o fomento da indústria de TIC no Brasil. Fui responsável pela concepção e estruturação de um programa de capacitação tecnológica no âmbito do PPI SOFTEX. Este projeto, o primeiro do Atlântico nesse modelo, estabeleceu um novo precedente para futuras captações de recursos.","highlights":["Liderei a concepção e definição do programa de capacitação, incluindo pesquisa de mercado, modelos de ensino e o público-alvo.","Propus e detalhei 6 cursos, com 4 selecionados (Ciência de Dados, Computação Cognitiva, Experiência de Usuário, Desenvolvimento Full Stack), baseando-me nas necessidades do mercado, cliente e Atlântico.","Estruturei o conteúdo didático completo dos cursos, dividindo-o em módulos inicial, intermediário e avançado.","Desenhei o programa em 3 fases (nivelamento, capacitação tecnológica e residência) e implementei metodologia de ensino online híbrida com avaliações por competências.","Defini indicadores de desempenho e métricas quantificáveis para o projeto, alinhados com as metas do edital SOFTEX."]},{"name":"Virtualização em Nuvem de Thin-Client de Alta Performance para Hewlett-Packard (HP)","description":"Este projeto envolveu o design e a arquitetura de uma solução Thin-Client baseada em nuvem para a HP. O objetivo era permitir que os usuários acessassem estações de trabalho virtuais poderosas, com GPUs, de forma segura e eficiente a partir de seus laptops e PCs existentes, com um foco crucial em oferecer baixa latência e alta estabilidade.","highlights":["Arquitetei uma solução Thin-Client baseada em nuvem, atendendo à necessidade de acesso escalável e seguro a estações de trabalho virtuais de alta performance, incluindo GPUs.","Projetei um backbone robusto de streaming de dados usando Apache Kafka para garantir um fluxo de dados eficiente e escalável, crucial para manter a baixa latência.","Integrei protocolos avançados de streaming e desktop remoto para entregar uma experiência de usuário responsiva, imersiva e altamente estável para acesso a partir de laptops e PCs.","Criei a apresentação e ajudei a apresentar para os principais stakeholders da HP em Boise, EUA, demonstrando sua viabilidade técnica e valor de negócio."]},{"name":"Projeto H2020 OCARIOT da União Europeia e Brasil: Avanços em IoT, IA e Intervenções de Saúde Personalizadas para a Obesidade Infantil","description":"O projeto OCARIOT, uma iniciativa internacional financiada pela União Europeia e pela RNP do Brasil, teve como objetivo combater a obesidade infantil por meio de uma abordagem inovadora e impulsionada pela tecnologia. Ele desenvolveu uma solução de coaching personalizado baseada em IoT, utilizando Ciência de Dados e IA para promover hábitos alimentares saudáveis e aumentar a atividade física entre crianças. Foi um esforço abrangente de pesquisa e desenvolvimento envolvendo um consórcio diversificado de 12 instituições da Europa e do Brasil.","highlights":["Concepção e Design Técnico do Projeto: Trabalhei com diversas instituições brasileiras e europeias na concepção do projeto antes de sua aprovação, e contribuí para a estimativa de recursos. Também redigi os documentos que garantiram seu financiamento para submissão conjunta tanto à União Europeia quanto ao Brasil.","Design de IoT e Arquitetura: Desenvolvi a arquitetura e auxiliei na implementação de uma plataforma IoT escalável e aberta, integrando diversos sensores para coleta abrangente de dados de saúde (ex: antropometria, atividade, sono, dieta, fatores ambientais).","Desenvolvimento de Algoritmos Avançados: Contribui para o projeto e desenvolvimento de algoritmos essenciais para análise de saúde, análise de séries temporais e algoritmos pioneiros de aprendizado de máquina para diagnóstico, prognóstico e intervenções personalizadas para a obesidade infantil.","Ciência de Dados e Análise: Ajudei na análise exploratória de conjuntos de dados de sensores e questionários para refinar algoritmos e aprimorar a personalização do Sistema de Apoio à Decisão (DSS).","Supervisão de Piloto e Implementação: Auxiliei estrategicamente no design da fase piloto do projeto, validando a eficácia e usabilidade da solução em ambientes do mundo real.","Liderança Técnica e Revisão: Proporcionei liderança técnica e conduzi revisões rigorosas, garantindo alta qualidade e alinhamento estratégico das entregas do projeto.","Engajamento com Stakeholders: Apresentei e defendi o progresso do projeto e as inovações técnicas para stakeholders de alto nível da União Europeia e da RNP em Madri, Espanha, e Bruxelas, Bélgica."]}],"references":[{"reference":"Posso prover referências profissionais sob demanda."}]}